package com.emranlive.www.ramadan2017.other;

/**
 * Created by Imran on 5/16/2017.
 */

public class extraDoyaData {
    public static final String[] titleArray = {
            "আজান শুনার পর দোয়া",
            "তারাবীহ নামাজের নিয়ত",
            "তারাবীহ নামাজের দোয়া",
            "মুনাজাত",
            "কবর যিয়ারতের দোয়া",
            "নিদ্রা যাওয়ার দোয়া",
            "নিদ্রা থেকে উঠার পর দোয়া",
            "পায়খানায় প্রবেশের দোয়া",
            "পায়খানা থেকে বাহির হওয়ার সময় দোয়া",
            "ওযুর শেষে পড়ার দোয়া",
            "বাড়ী থেকে বের হওয়ার দোয়া",
            "মসজিদে প্রবেশের করার দোয়া",
            "মসজিদ থেকে বের হওয়ার সময় দোয়া",
            "খানা সামনে আনা হলে দোয়া",
            "খানা খাওয়ার দোয়া",
            "খাবার শুরুতে বিসমিল্লাহ বলতে ভুলে গেলে এই দোয়া পড়তে হয়",
            "খাবার শেষে দোয়া",
            "নৌকা আহরনের দোয়া",
            "যানবাহনে উঠার দোয়া",
            "স্ত্রী সহবাসের দোয়া",
            "সালাতুত তাসবীহর দোয়া",
            "মৃত্যুর সংবাদ শুনলে ও কোনো কিছু হারিয়ে গেলে পড়তে হয়",
            "কবরে মাটি দেয়ার দোয়া",
            "কবরবাসীকে সালাম দেয়ার দোয়া",
            "কবর যিয়ারতের দোয়া",
            "তওবা",
            "দরুদ",
            "পানি পানের শুরুতে",
            "পানি পানের শেষে"
        };

    public static final String[] detailsArray = {
            "আল্লা-হুম্মা রব্বা হা-যিহিদ দা'ওয়াতিত তা-ম্মাতি ওয়াস সাল-তিল-কা'ইমাতি আ-তি মুহাম্মাদানিল ওয়াসীলাতা ওয়াল ফাদীলাতা ওয়াব'আছহু মাকা-মাম মাহমূদানিল্লাযী ওয়া'আদতাহ, ইন্নাকা লা তুখলিফুল মী'আদ",
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা-হি তা আলা রাকয়াতাই সিলাতিত তারাবীহী সুন্নাতু রাসূলিল্লা-হিতাআলা মুতাওয়াজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার",
            "সুবহানা জিল মুলকি ওয়াল মালাকুতি সুবহানা জিল ইজ্জাতি ওয়াল আজমাতি ওয়াল হায়বাতি ওয়াল কুদরাতি ওয়াল কিবরিয়ায়ি ওয়াল জাবারুতি সুবহানাল মালিকিল হাইয়্যিল্লাজি লা ইয়ানামু ওয়ালা ইয়ামুতু আবাদান আবাদান সুব্বুহুন কুদ্দুসুন রাব্বানা ওয়া রাব্বুল মালা-ইকাতি ওয়াররুহ। \n(প্রত্যেক চার রাকয়াত নামাযের পর এই দোয়া পড়িতে হইবে)",
            "রাব্বানা আতিনা ফিদ্দুনইয়া হাসানাতাও ওয়া ফিল আখিরাতি হাসানাতাও ওয়াকিনা আ'জাবান্নার",
            "আসসালামু আলাইকুম ইয়া আহলাল কুবুরি ইয়াগফিরুল্লাহ লানা ওয়ালাকুম আনতুম ছালাফুনা ওয়া নাহনু বিলআছারি",
            "আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইয়া",
            "আলহামদু লিল্লাহিল্লাযী আহইয়া না বা'দা মা আমাতানা ওয়া ইলাইহিন নুশ",
            "আল্লাহুম্মা ইন্নী আউযুবিকা মিনাল খুবুসী ওয়াল খাবায়িস",
            "গুফরানাকা আলহামদু লিল্লাহিল্লাযী আযহাবা আন্নিল আযা ওয়া আ'ফানী",
            "আশহাদু আল লা ইলা-হা ইল্লাল্লাহু অহদাহু লা শারীকা লাহ, অ আশহাদু আন্না মুহাম্মাদান আবদুহু অরাসূলুহ",
            "বিসমিল্লাহি তাওয়াক্কালতু আলাল্লাহি লা-হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহি",
            "আল্লাহুম্মাফ তাহলী আবওয়াবা রাহমাতিকা",
            "আল্লাহুম্মা ইন্নি আছআলুকা মিন ফাদলিকা",
            "আল্লাহুম্মা বারিক লানা ফী-মা রাযাকতানা ওয়াকিনা আযাবান্নারি",
            "বিসমিল্লাহি ওয়া'আলা বারাকা-তিল্লা",
            "বিসমিল্লাহি আউয়ালাহু ওয়া আখিরাহু",
            "আলহামদু লিল্লাহিল্লাযী আত'আমানা ওয়া ছাকানা ওয়া জা'আলানা মিনাল মুসলিমীন।",
            "বিসমিল্লাহি মাজরেহা ওয়া মুরছাহা ইন্না রাব্বি লা গাফুরুর রাহীম",
            "আলহামদু লিল্লাহি সুবহানাল্লাযী সাখখারা লানা হা-যা ওয়ামা কুন্না লাহু মুকরিনীন, ওয়া ইন্না ইলা রাব্বিনা লামুনকালিবুন",
            "বিসমিল্লাহি আল্লাহুম্মা জান্নিবনাশ শাইতানা ওয়া জান্নিবিশশাইতানা মা রযাকতানা",
            "সুবহানাল্লাহি ওয়ালহামদুলিল্লাহি ওয়া-লা-ইলাহা ইল্লাল্লাহু আল্লাহু আকবার",
            "ইন্না লিল্লাহি ওয়া ইন্না ইলাইহি রাজিউন",
            "মিনহা খালাকনাকুম, অফীহা নুয়ী'-দুকুম, অমিনহা নুখরিজুকুম তারাতান উখরা",
            "আসসালামু আলাইকুম ইয়া আহলাল কুবুর",
            "আসসালামু আলাইকুম ইয়া আহলাল কুবুরি ইয়াগফিরুল্লাহ লানা ওয়ালাকুম আনতুম ছালাফুনা ওয়া নাহনু বিলআছারি",
            "আস্তাগফিরুল্লাহা রাব্বি মিন কুল্লি যাব্বিও ওয়া আতুবু ইলাইহি, লা-হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহিল আলিয়্যিল আজীম",
            "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিন ওয়া আ'লা আলি মুহাম্মাদিউ ওয়া আনঝিলহু মাকাআ'দাল মুকাররাবি ইন্দাকা ইয়াওমাল কিয়ামাহ।\n(তাবরানী, কানজুল উম্মাল)",
            "বিসমিল্লাহির রাহমানীর রাহিম",
            "আলহামদুলিল্লাহ",
        };
}
