package com.emranlive.www.ramadan2017.other;

/**
 * Created by Imran on 5/13/2017.
 */

public class RamadanData {

    public static final String[] noArray1 = {"রোজা ১","রোজা ২","রোজা ৩","রোজা ৪","রোজা ৫",
            "রোজা ৬","রোজা ৭","রোজা ৮","রোজা ৯","রোজা ১০","রোজা ১১","রোজা ১২","রোজা ১৩","রোজা ১৪","রোজা ১৫",
            "রোজা ১৬","রোজা ১৭","রোজা ১৮","রোজা ১৯","রোজা ২০","রোজা ২১","রোজা ২২","রোজা ২৩","রোজা ২৪","রোজা ২৫",
            "রোজা ২৬","রোজা ২৭","রোজা ২৮","রোজা ২৯","রোজা ৩০"};

    public static final String[] dateArray1 = {"২৮ মে, রবিবার", "২৯ মে, সোমবার", "৩০ মে, মঙ্গলবার", "৩১ মে, বুধবার",
            "০১ জুন, বৃহস্পতিবার", "০২ জুন, শুক্রবার", "০৩ জুন, শনিবার", "৪ জুন, রবিবার", "৫ জুন, সোমবার", "৬ জুন, মঙ্গলবার",

            "০৭ জুন, বুধবার", "০৮ জুন, বৃহস্পতিবার", "০৯ জুন, শুক্রবার", "১০ জুন, শনিবার", "১১ জুন, রবিবার",
            "১২ জুন, সোমবার", "১৩ জুন, মঙ্গলবার", "১৪ জুন, বুধবার", "১৫ জুন, বৃহস্পতিবার", "১৬ জুন, শুক্রবার",

            "১৭ জুন, শনিবার","১৮ জুন, রবিবার","১৯ জুন, সোমবার","২০ জুন, মঙ্গলবার","২১ জুন, বুধবার",
            "২২ জুন, বৃহস্পতিবার","২৩ জুন, শুক্রবার","২৪ জুন, শনিবার","২৫ জুন, রবিবার","২৬ জুন, সোমবার"};

    public static final int[] sehriTimeMinute1 = {40,40,40,39,39,39,39,39,39,38, 38,38,38,38,38,38,37,38,38,38,
            38,38,38,38,38,39,39,39,39,40};

    public static final int[] iftarTimeMinute1 = {44,44,45,45,46,46,46,47,47,47, 48,48,49,49,50,50,50,50,51,51,
            51,51,52,52,52,52,53,53,53,53};

}
